Тестовая_база_ERP_14/src/Documents/CRM_ЭтапКалендарногоПлана/CRM_ЭтапКалендарногоПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>CRM_ЭтапКалендарногоПлана</name>
  <basedOn>Catalog.CRM_ЭтапыПроектов</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Этап</name>
    <type>
      <types>CatalogRef.CRM_ЭтапыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяДлительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДатаОкончания</name>
    <comment>Фактическая дата окончания задачи</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяДлительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <comment>Описание результата закрытия точки</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СписокУчастников</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.CRM_СтатусыЭтаповКалендарногоПлана</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <comment>Название задачи проекта или контрольной точки</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЭтапа</name>
    <type>
      <types>EnumRef.CRM_ТипыЭтапов</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийОтменыЗадачи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВведенВручную</name>
    <comment>Признак того что этап введен вручную</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВариантыКонтекстаФайлов</name>
    <attributes>
      <name>ВариантКонтекстаФайлов</name>
      <type>
        <types>CatalogRef.CRM_ВариантыКонтекстаФайла</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Смещения</name>
    <comment>История смещения сроков КТ</comment>
    <attributes>
      <name>СмещениеДатаНачало</name>
      <comment>История смещенной даты</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>СмещениеДатаОкончание</name>
      <comment>История смещений даты</comment>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <comment>обязателен для заполнения</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <comment>Автор изменения</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Участники</name>
    <comment>Участники и ответственные по задаче/контрольной точке</comment>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <comment>Признак ответственного</comment>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныйДляОтбора</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Телефон</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЧекЛист</name>
    <attributes>
      <name>ОписаниеЗадачи</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Enums/CRM_ТипыЭтапов/CRM_ТипыЭтапов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_ТипыЭтапов</name>
  <enumValues>
    <name>Этап</name>
  </enumValues>
  <enumValues>
    <name>КонтрольнаяТочка</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Enums/CRM_СтатусыЭтаповКалендарногоПлана/CRM_СтатусыЭтаповКалендарногоПлана.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_СтатусыЭтаповКалендарногоПлана</name>
  <enumValues>
    <name>Запланирована</name>
    <comment>Используется при создании</comment>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Выполнена</name>
  </enumValues>
  <enumValues>
    <name>Проверена</name>
  </enumValues>
  <enumValues>
    <name>Отменена</name>
  </enumValues>
</mdclass:Enum>

Тестовая_база_ERP_14/src/Documents/CRM_ЭтапКалендарногоПлана/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
	Настройки.ПриПолученииСлужебныхРеквизитов = Истина;
	
КонецПроцедуры

// Ограничивает видимость реквизитов объекта в отчете по версии.
//
// Параметры:
// Реквизиты - Массив - список имен реквизитов объекта.
Процедура ПриПолученииСлужебныхРеквизитов(Реквизиты) Экспорт
	
	// Исключаемые реквизиты
	Реквизиты.Добавить("БизнесНаправление");
	Реквизиты.Добавить("БизнесПроцесс");
	Реквизиты.Добавить("Важность");
	Реквизиты.Добавить("ВедущийЭтап");
	Реквизиты.Добавить("КартаМаршрута");
	Реквизиты.Добавить("Направление");
	Реквизиты.Добавить("Подразделение");
	Реквизиты.Добавить("МодельЭтапа");
	Реквизиты.Добавить("ЭтапПредок");
	Реквизиты.Добавить("БизнесРегион");
	Реквизиты.Добавить("ВведенВручную");
	
	//Иисключаемые табличные части
	Реквизиты.Добавить("ЧекЛист.*");
	Реквизиты.Добавить("ВариантыКонтекстаФайлов.*");
	Реквизиты.Добавить("Смещения.*");
	Реквизиты.Добавить("ПользователиKT.*");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти
	
#Область ОбновлениеИнформационнойБазы

Процедура ПереходНаНовыеРеквизитыДокумента() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CRM_ЭтапКалендарногоПлана.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.CRM_ЭтапКалендарногоПлана КАК CRM_ЭтапКалендарногоПлана";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ДокументОбъект.ТипЭтапа 				= Перечисления.CRM_ТипыЭтапов.КонтрольнаяТочка;
		ДокументОбъект.ПлановаяДатаНачала 		= ДокументОбъект.Дата;
		ДокументОбъект.ПлановаяДатаОкончания 	= ДокументОбъект.Дата;
		ДокументОбъект.ФактическаяДатаОкончания = ДокументОбъект.ФактическаяДатаНачала;
		Если ЗначениеЗаполнено(ДокументОбъект.ФактическаяДатаНачала) Тогда
			ДокументОбъект.Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Проверена;
		Иначе
			ДокументОбъект.Статус = Перечисления.CRM_СтатусыЭтаповКалендарногоПлана.Запланирована;
		КонецЕсли;
		
		ДокументОбъект.ВведенВручную = Истина;
		
		ДокументОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти //ОбновлениеИнформационнойБазы

#КонецЕсли

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Представление = Данные.Ссылка.Тема;
	
КонецПроцедуры
